<a href="https://colab.research.google.com/github/Nethra07-star/PYTHON-FOR-ML/blob/main/pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd
df=pd.DataFrame
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [8]:
emp=pd.Series(['parker','john','smith','william'])
id=pd.Series([102,107,109,114])
frame={'Emp':emp,'ID':id}
result=pd.DataFrame(frame)
print("\nSeries to Data frame\n")
print(result)

Series to Data frame

       Emp   ID
0   parker  102
1     john  107
2    smith  109
3  william  114

In [9]:
print("\nExtracting one column:\n")
print(result['Emp'])

Extracting one column:

0     parker
1       john
2      smith
3    william
Name: Emp, dtype: object

In [13]:
print("\n Adding one column:\n")
result ['Age']=pd.Series([35,24,40.38])
print(result)

 Adding one column:

       Emp   ID    Age
0   parker  102  35.00
1     john  107  24.00
2    smith  109  40.38
3  william  114    NaN

In [14]:
print("\n Deleting one column:\n")
del result['Age']
print(result)

 Deleting one column:

       Emp   ID
0   parker  102
1     john  107
2    smith  109
3  william  114

In [15]:
print("\n Extracting the third row:\n")
print(result.loc[2])

 Extracting the third row:

Emp    smith
ID       109
Name: 2, dtype: object

In [17]:
print("slice rows:\n",result[1:3])

slice rows:
      Emp   ID
1   john  107
2  smith  109

In [21]:
d2=pd.DataFrame([['Dale',123],['Mark',143]],columns=['Emp','ID'])
result=pd.concat([result,d2],ignore_index=True)
print("\n Adding new row values:\n",result)

 Adding new row values:
        Emp   ID
0   parker  102
1     john  107
2    smith  109
3  william  114
4     Dale  123
5     Mark  143

In [25]:
print("\n deleting psrticular row:\n",result.drop(1))

 deleting psrticular row:
        Emp   ID
0   parker  102
2    smith  109
3  william  114
4     Dale  123
5     Mark  143